In [9]:
import pandas as pd

df=pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/ford_escort.csv')
df.head()

   Year   "Mileage (thousands)"    "Price"
0  1998                      27       9991
1  1997                      17       9925
2  1998                      28      10491
3  1998                       5      10990
4  1997                      38       9493

In [10]:
df.tail()

    Year   "Mileage (thousands)"    "Price"
18  1996                      29       7990
19  1995                      72       5994
20  1993                      72       5994
21  1994                      61       5500
22  1998                       7      11000

In [13]:
print(df.isna().sum())

Year                      0
 "Mileage (thousands)"    0
  "Price"                 0
dtype: int64

In [12]:
print(df.shape)

(23, 3)

In [14]:
df1=df.copy()
df1=df1.dropna()
print(df1.isna().sum())
print(df1.shape)

Year                      0
 "Mileage (thousands)"    0
  "Price"                 0
dtype: int64
(23, 3)

In [15]:
df.duplicated().sum()
df=df.drop_duplicates()
df.duplicated().sum()

0

In [16]:
df.isna().sum()

Year                      0
 "Mileage (thousands)"    0
  "Price"                 0
dtype: int64

In [ ]:
df= df.copy()
df=df.fillna(method='ffill&#39;)
df=df.fillna(method=&#39;bfill&#39;)